### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [67]:
import pandas as pd

In [68]:
series_data=pd.Series([4,8,15,16,23,42])

In [69]:
print(series_data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [79]:
series=['Saksham','Sharma',121,988]

In [80]:
pd.Series(series)

0    Saksham
1     Sharma
2        121
3        988
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [81]:
dataframe={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']}

In [82]:
pd.DataFrame(dataframe)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types, similar to a spreadsheet or SQL table. It is the most commonly used Pandas object, and it allows you to store and manipulate tabular data in a flexible and powerful way. In other words, a DataFrame is a table where each column can have a different data type.

On the other hand, a Pandas Series is a one-dimensional labeled array that can hold data of any type, including objects, integers, and floats. A Series is similar to a column in a spreadsheet or a database table.



DataFrame is a table with multiple columns, while a Series is a single column of data.

In [83]:
##DataFrame eg:
df=pd.DataFrame(dataframe)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [84]:
## Series eg
age_series=df['Age']
pd.Series(age_series)

0    25
1    30
2    27
Name: Age, dtype: int64

### Q5.What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

###### Pandas provides a variety of functions to manipulate data in a DataFrame. Some of the most common ones are:

1.head() and tail(): These functions can be used to view the first or last n rows of a DataFrame, respectively. They are useful for quickly getting a sense of what the data looks like.

2.describe(): This function provides summary statistics for each column in a DataFrame, such as count, mean, standard deviation, minimum, and maximum values. It's useful for getting a quick overview of the data.

3.loc[] and iloc[]: These functions can be used to select rows and columns in a DataFrame by label or index, respectively. They are useful for extracting specific subsets of data.

4.drop(): This function is used to remove rows or columns from a DataFrame. It's useful for getting rid of irrelevant or redundant data.

5.sort_values(): This function is used to sort a DataFrame by one or more columns. It's useful for arranging the data in a meaningful way.

6.fillna(): This function is used to fill missing values in a DataFrame with a specified value or method. It's useful for dealing with missing data.

###### For eg
I can use info() to known the how many missing value in our dataframe.

In [49]:
df=pd.read_csv("D:\Data_Science_(PW)\dataset_pandas\services.csv")

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 22 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       23 non-null     int64
 1   location_id              23 non-null     int64
 2   program_id               0 non-null      float64
 3   accepted_payments        1 non-null      object
 4   alternate_name           1 non-null      object
 5   application_process      23 non-null     object
 6   audience                 14 non-null     object
 7   description              23 non-null     object
 8   eligibility              21 non-null     object
 9   email                    1 non-null      object
 10  fees                     21 non-null     object
 11  funding_sources          21 non-null     object
 12  interpretation_services  1 non-null      object
 13  keywords                 21 non-null     object
 14  languages                1 non-null      object
 15  name                     23 non-null     object
 16  required_documents       1 non-null      object
 17  service_areas            21 non-null     object
 18  status                   23 non-null     object
 19  wait_time                19 non-null     object
 20  website                  2 non-null      object
 21  taxonomy_ids             1 non-null      object
dtypes: float64(1), int64(2), object(19)
memory usage: 4.1+ KB

from here we can detect that  some coloumn have null value like email,alternate_name, wait_time

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature ,while Panel is considered as an immutable data structure in pandas.

In [85]:
df['new']=Name="Saksham"

In [86]:
df

     Name  Age  Gender      new
0   Alice   25  Female  Saksham
1     Bob   30    Male  Saksham
2  Claire   27  Female  Saksham

In [101]:
s=pd.Series(age_series)

In [102]:
s

0    25
1    30
2    35
Name: Age, dtype: int64

In [103]:
s.loc[2]=45

In [105]:
s

0    25
1    30
2    45
Name: Age, dtype: int64

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [117]:
s1=pd.Series([1,2,3,4,5,7])
s2=pd.Series(["Saksham","Sharma","India","DataSciene","ML"])
s3=pd.Series([9,8,7,6,54,4])

In [118]:
dataframe=s1,s2,s3
pd.DataFrame(dataframe)

         0       1      2           3   4    5
0        1       2      3           4   5  7.0
1  Saksham  Sharma  India  DataSciene  ML  NaN
2        9       8      7           6  54  4.0